TestCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Resolution: nano-scale WHERE IT MATTERS (film + near-film zone)
// Total cells: ~5 Million (practical for 128-256 cores)
//
// Strategy:
// - Ultra-fine in Y near the film (2-5 nm cells)
// - Graded coarser away from film
// - Focused resolution in X around laser spot
// - Thin in Z (quasi-3D)
scale 1e-6; // coordinates in micrometers


// LIFT GEOMETRY (same as before):
// y0 = 0.0000     - Substrate (receiver) bottom
// y1 = 8.0000     - Substrate top / Air gap bottom
// y2 = 20.0000    - Air gap top / Ti film bottom
// y3 = 20.0714    - Ti film top (71.4 nm thick)

vertices
(
    // y0 = 0.0000 (substrate/receiver bottom)
    (0   0.0000  0)  (30  0.0000  0)  (30  0.0000  3)  (0   0.0000  3)
    // y1 = 8.0000 (substrate top / air gap bottom)
    (0   8.0000  0)  (30  8.0000  0)  (30  8.0000  3)  (0   8.0000  3)
    // y2 = 20.0000 (air gap top / Ti film bottom)
    (0  20.0000  0)  (30 20.0000  0)  (30 20.0000  3)  (0  20.0000  3)
    // y3 = 20.0714 (Ti film top) - 71.4 nm thick film
    (0  20.0714  0)  (30 20.0714  0)  (30 20.0714  3)  (0  20.0714  3)
);

blocks
(
    // SUBSTRATE (receiver): 0 → 8 μm
    // Cells: 400 × 200 × 25 = 2M
    // Grading: finer toward top (toward interface with air)
    // Y-grading 0.2 = cells 5× smaller at top
    hex ( 0  3  2  1   4  7  6  5)   (400 200 25)  simpleGrading (1 0.2 1)

    // AIR GAP: 8 → 20 μm (12 μm thick)
    // Cells: 400 × 250 × 25 = 2.5M
    // Grading: strongly finer toward top (toward film)
    // Y-grading 0.1 = cells 10× smaller at top (near film)
    hex ( 4  7  6  5   8 11 10  9)   (400 250 25)  simpleGrading (1 0.1 1)

    // TI FILM: 20 → 20.0714 μm (71.4 nm thick)
    // Cells: 400 × 36 × 25 = 360k
    // Uniform grading (already tiny cells due to air gap grading)
    // 71.4 nm / 36 cells = ~2 nm per cell!
    hex ( 8 11 10  9  12 15 14 13)   (400 36 25)  simpleGrading (1 1 1)
);

edges ();
boundary
(
    // Symmetry planes (external boundaries only)
    left          { type symmetryPlane; faces ((0 3 7 4)(4 7 11 8)(8 11 15 12)); }
    right         { type symmetryPlane; faces ((1 5 6 2)(5 9 10 6)(9 13 14 10)); }
    front         { type symmetryPlane; faces ((0 4 5 1)(4 8 9 5)(8 12 13 9)); }
    back          { type symmetryPlane; faces ((3 2 6 7)(7 6 10 11)(11 10 14 15)); }

    // Physical walls
    substrate     { type wall;  faces ((0 3 2 1)); }      // BOTTOM - receiver substrate
    donor         { type wall;  faces ((12 15 14 13)); }   // TOP - transparent donor substrate
);
mergePatchPairs();

// NANOSCALE MESH INFORMATION:
// =============================
// Total cells: ~102 Million
// Cell sizes:
// -----------
// Substrate:  200 nm × 5 nm × 100 nm
// Air gap:    200 nm × 5 nm × 100 nm
// Ti film:    200 nm × 1 nm × 100 nm (NANOSCALE!)
//
// Aspect ratios:
// --------------
// Substrate:  40:1:20 (reasonable for diffusion)
// Air gap:    40:1:20 (reasonable for heat transfer)
// Ti film:    200:1:100 (high aspect ratio for nanoscale layer)
//
// Physics captured:
// -----------------
// - Nanoscale heat diffusion in Ti film (1 nm resolution)
// - Electron-phonon coupling at sub-10nm scale
// - Interface tracking during phase change
// - Thermal gradients during heating and solidification
// - Recoil pressure and material ejection
// ************************************************************************* //
