TestCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compInterFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
// EXTENDED SIMULATION TIME for complete solidification
// Phase 1 (0-200 ps):     Laser heating and initial material response
// Phase 2 (200-500 ps):   Material ejection and transfer
// Phase 3 (500-2000 ps):  Cooling and solidification (2 ns total)
endTime         2e-9;          // 2 nanoseconds - complete LIFT cycle
// TIME STEPPING - Adaptive with stability constraints
deltaT          1e-16;         // Initial: 0.1 fs (very small for nanoscale)
maxDeltaT       5e-15;         // Maximum: 5 fs (adaptive growth allowed)
minDeltaT       1e-17;         // Minimum: 0.01 fs (ultimate precision)

adjustTimeStep  yes;           // ENABLE adaptive time stepping
maxCo           0.15;          // Increased from 0.02 - allow dt growth!
maxAlphaCo      0.25;         // Aggressive interface limit
maxDi           8;             // Interface dilation limit

verbose         true;
thermalFluxRelax 0.1;          // Stronger damping of interface heat flux
maxThermalCourant 0.25;         // Increased from 0.02 - allow dt growth!

// ADAPTIVE OUTPUT - more frequent during active phase, less during cooling
writeControl    adjustableRunTime;
writeInterval   2e-13;         // Write every 200 fs initially
purgeWrite      200;           // Keep many snapshots for analysis
writeFormat     binary;
writePrecision  10;
writeCompression off;
timeFormat      scientific;
timePrecision   12;             // Increased precision for longer runs
fileHandler     uncollated;

runTimeModifiable yes;
enableLiftProcessTracker true;

// EXTENDED PHASE-CHANGE - longer activation for complete process
phaseChangeCoeffs
{
    model               clausius_clapeyron;  // Not temperature window!
    hf                  [0 2 -2 0 0 0 0] 9.1e6;   // J/kg (Ti vaporisation)
    gasConstant         [0 2 -2 -1 0 0 0] 174;    // J/kg/K (Ti vapor)
    Tsol                [0 0 0 1 0 0 0] 1941;     // K
    Tvap                [0 0 0 1 0 0 0] 2200;     // K
    
    // Kinetic theory parameters
    evaporationCoeff       0.3;     // Ti evaporation coefficient
    momentumAccom       0.18;     // Momentum accommodation
    
    dtFloor             1e-16;         // Reduced for precision
    relaxationTime      1e-12;        // Faster response for femtosecond dynamics
    alphaMin            0.001;        // CRITICAL: Allow phase change in interface cells (was defaulting to 0.01)
    //alphaMax            0.999;        // Symmetric upper bound
    maxSource           [1 -1 -3 0 0 0 0] 1e22;         // Permit HK flux to sustain the ~80 MPa recoil plateau at 6.6 kK (Feinaeugle et al., Appl. Surf. Sci. 418, 2017)
    minCoefficient      1e6;          // Reduced for gradual cooling
    onlyAboveVapor      false;
    metalFractionCutoff 1e-6;
    // EXTENDED ACTIVATION - through transfer and cooling
    activationTime      ((0 2e-10));  // Active through 400 ps
}

// EXTENDED MASS TRANSFER - through solidification
massTransferCoeffs
{
    tStart  (0);
    tEnd    (2e-10);   // Active through 400 ps
    rateMax 3e13;          // High enough for complete film ablation
}

// LASER TIMING - shorter pulse, longer observation
laserStartTime      0;
laserEndTime    2e-10;

// Advanced interface capturing - TUNED FOR EXTENDED SIMULATION
useAdvancedInterfaceCapturing  true;
advancedInterfaceCapturing
{
    model               kinetic_theory;  // Not arbitrary scaling!
    stickingCoeff       0.18;
    momentumAccom       0.18;
    // Knight (Phys. Rev. B 20, 1979) predicts recoil pressures exceeding
    // 0.3 GPa near 6000 K.  The fs deposition pushes Tl well beyond that, so
    // allow the kinetic-theory recoil driver to reach the multi-GPa recoil
    // levels observed in ultrafast LIFT experiments before clamping.
    recoilMax             3.0e9;       // GPa-level recoil pressures
    clampRecoil           false;
    scaleRecoilMax        false;
    recoilTempOffset      0;
    phaseChangeTempOffset 0;
    recoilRelax           0.5;
    alphaMin              0.001;
    massRateEps           1e-6;
    maxPhysicalTemperature 10000;
        // Physical limits
    // Keep the absolute bound consistent with the multi-GPa recoil required to
    // sustain fs-LIFT expulsion without premature pressure clamping.
    maxRecoilPressure   3.0e9;       // GPa-level recoil pressures
}
logRecoilSuppression true;

// Temperature clamping - EXTENDED RANGE
enableTClamp    false;
minT            200;           // Allow cooling below room temp
maxT            10000;          // Clamp high temperatures in line with lattice limit

// Two-temperature model properties - OPTIMIZED FOR EXTENDED RUNS
twoTemperatureProperties
{
    // Linear electronic heat capacity: Ce = γTe
    Ce
    {
        type        polynomial;
        value       0;
        coeffs
        (
            (0   0)  // Constant term = 0
            (630 1)  // Linear term: Ce = 630 · Te [J/m³/K²]
        );
    }
    
    // Temperature-dependent coupling
G
{
    type table;
    values
    (
            (300      1.0e18)
            (1000     2.0e18)
            (2000     1.5e18)
            (3000     4.0e18)
            (5000     1.5e19)
            (10000    8.0e19)
            (20000    2.5e20)
    );
}
    
    Cl  [1 -1 -2 -1 0 0 0] 2.5e6;
    De  [0  2 -1  0 0 0 0] 1e-4;

    gasMetalExchangeCoeff
    {
        type        kapitza;    // Use acoustic mismatch model
        Z_metal     2.3e7;      // Ti acoustic impedance [Pa·s/m]
        Z_gas       383;        // Ar acoustic impedance [Pa·s/m]
        rho_metal   4500;       // Ti density [kg/m^3]
        rho_gas     1.7;        // Ar density [kg/m^3]
        maxTemperature 0;      // Optional cap [K] (0 => no cap)
    }
    gasMetalCutoffTemperature 2200;
    minMetalFractionForExchange 0.5;
    minGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 1e8;
    maxGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 5e9;
    maxGasMetalHeatFlux    5e9;
    minTe           200;
    maxTe           20000;      // Allow hot electrons
    maxTl           10000;       // Clamp closer to experimental 6600 K peak (Feinaeugle 2017)
    ambientTemperature 300;
    temperatureDifferenceFloor 10.0;                     // ← MISSING (causes singularities)
    // ADAPTIVE MICRO-STEPPING
    electronSubCycles        1;
    minElectronSubCycles     1;
    maxElectronSubCycles     20;      // Higher for 1nm cells
    maxElectronDeltaT        [0 0 1 0 0 0 0] 5e-16;  // Guard rapid transients

    nInnerCouplingSweeps         3;  // More coupling iterations
    innerCouplingResidualTol     1e-43 // Enable convergence check
    
    klHighTThreshold 1000;
    klExponent       0.5;

    metalFractionFloor      1e-9;
    metalFractionCutoff     1e-6;
    metalAmbientBlendWidth  1e-3;
    CvolGasFloor            1e6;

    energyTolerance         0.02;       // Tight for nanoscale
    energyDiagnostics       true;
    temperatureDiagnostics  true;
    energyAudit             true;
}

// POST-PROCESSING AND MONITORING
functions
{
    // Field monitoring at key locations
    probePoints
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   100;

        fields
        (
            T
            Tl
            Te
            p_rgh
            alpha.metal
            U
        );

        probeLocations
        (
            (15e-6  20.0357e-6  1.5e-6)    // Film center (laser focus)
            (15e-6  20.0000e-6  1.5e-6)    // Film bottom (Ti-air interface)
            (15e-6  20.0714e-6  1.5e-6)    // Film top (Ti-donor interface)
            (15e-6  8.0000e-6   1.5e-6)    // Substrate-air interface
            (15e-6  19.5000e-6  1.5e-6)    // Near film (0.5 μm below)
        );
    }
    // Mid-plane visualization
    midPlaneVTK
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    writeTime;
        writeInterval   1;
        surfaceFormat   vtk;
        fields          (alpha.metal Tl Te T p_rgh U);

        surfaces
        (
            midPlane
            {
                type                cuttingPlane;
                planeType           pointAndNormal;
                pointAndNormalDict
                {
                    point   (15e-6 10e-6 5e-6);
                    normal  (0 1 0);
                }
                interpolate         true;
            }
        );
    }

    // Volume-averaged quantities
    volumeAverages
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   10;
        writeFields     false;
        regionType      all;
        operation       volAverage;

        fields
        (
            T
            Tl
            Te
            alpha.metal
        );
    }
}
// ************************************************************************* //
