TestCase/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Keep the focusBox cellSet for debugging, but all refinement is now handled
// directly in blockMesh.  refineMesh therefore behaves as a pass-through copy.
set                 focusBox;
coordinateSystem    global;
globalCoeffs
{
    tan1   (1 0 0);   // x-direction
    tan2   (0 0 1);   // z-direction
    normal (0 1 0);   // y-direction (film thickness)
}

// Re-enable refinement along the film normal to capture the thin layers.
directions           (normal);

useHexTopology      no;
geometricCut        no;              // ensure no geometric splitting occurs
writeMesh           no;

nBufferLayers        0;
maxGlobalCells       30000000;
maxLocalCells        30000000;
minRefinementCells   0;

refinementRegions
{
  // With the film resolved directly in blockMesh, no additional refinement is required.
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
