TestCase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: setFields dictionary                 |
|  \\    /   O peration     | FORWARD TRANSFER (LIFT) initialization         |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
// Only numbers adjusted; no factors/models changed.
// Update the BOX LIMITS below to match your mesh (in meters).
// Coordinate convention: X,Z lateral, Y vertical (gravity in -Y, receiver at bottom).
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
defaultFieldValues
(
  volScalarFieldValue alpha.metal 0
  volScalarFieldValue alpha.air   0
  volScalarFieldValue Tl          300
  volScalarFieldValue Te          300
  volScalarFieldValue T           300
);

regions
(
    // ✅ FORWARD TRANSFER (LIFT) GEOMETRY (bottom to top):
    // Receiver substrate (bottom, 0-8 µm) - deposition target
    // This is where ablated material will deposit
    boxToCell
    {
        box (0        0          0)
            (50.0e-06 8.0000e-06 10.0e-06);
        fieldValues
        (
            volScalarFieldValue alpha.metal 1  // solid receiver substrate
            volScalarFieldValue alpha.air   0
        );

    }
    // Air gap between receiver and donor (8.0-20.0 µm, 12 µm)
    boxToCell
    {
        box (0        8.0000e-06 0)
            (50.0e-06 20.0000e-06 10.0e-06);
        fieldValues
        (
            volScalarFieldValue alpha.metal 0
            volScalarFieldValue alpha.air   1  // air-filled gap
        );
    }
    // Transparent donor substrate (20.0-28.0 µm, 8 µm)
    // NOTE: Treat as solid metal with alpha.metal=1 for structural stability, but laser model will not deposit energy here (only in Ti film)
    boxToCell
    {
        box (0        20.0000e-06 0)
            (50.0e-06 28.0000e-06 10.0e-06);
        fieldValues
        (
            volScalarFieldValue alpha.metal 1  // solid transparent substrate
            volScalarFieldValue alpha.air   0
        );
    }
    // Ti donor film on top of substrate (28.0-28.0714 µm, 71.4 nm thick)
    // This is the material that will be ablated and transferred forward (downward)
    boxToCell
    {
        box (0        28.0000e-06 0)
            (50.0e-06 28.0714e-06 10.0e-06);
        fieldValues
        (
            volScalarFieldValue alpha.metal 1  // pure Ti donor film
            volScalarFieldValue alpha.air   0
        );
    }
);
