TestCase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // FORWARD TRANSFER: Focus/jet region around Ti film at TOP
    {
        name focusBox;
        type cellSet;
        action new;
        source boxToCell;
        sourceInfo
        {
            // Refined region around laser focus and expected DOWNWARD jet trajectory
            // x: [16.6667, 33.3333] µm (aligned to blockMesh cell planes)
            // y: [20.0, 28.0714] µm (donor substrate + Ti film at top)
            // z: [2.5, 7.5] µm (centered around z=5 µm focus)
            box (16.6666667e-06 20.0e-06 2.5e-06)
                (33.3333333e-06 28.0714e-06 7.5e-06);
        }
    }
    // FORWARD TRANSFER: Receiver substrate at BOTTOM of domain
    { 
        name substrateSet; 
        type cellSet; 
        action new; 
        source boxToCell;
        sourceInfo 
        { 
            // Receiver substrate region: y: [0, 8] µm (bottom layer, deposition target)
            box (0 0 0) (50.0e-06 8.0000e-06 10.0e-06);
        } 
    }
    
    { 
        name substrate; 
        type cellZoneSet; 
        action new; 
        source setToCellZone;
        sourceInfo 
        { 
            set substrateSet; 
        } 
    }
);

// ************************************************************************* //
